Revit 2027 API
HostedSweep.HorizontalFlip Method
Flip the hosted sweep object along horizontal line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HorizontalFlip()
Public Sub HorizontalFlip
public:
void HorizontalFlip()
member HorizontalFlip : unit -> unit
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace